espruino/Espruino/targets/stm32_ll/jshardware.c
#if 0
  /* I2C configuration -------------------------------------------------------*/
  LL_I2C_InitTypeDef I2C_InitStructure;
  LL_I2C_StructInit(&I2C_InitStructure);
  I2C_InitStructure.Timing = 0x00F02B86; // VVE : from i2c example. To retrieve from somewhere else.
  I2C_InitStructure.PeripheralMode = LL_I2C_MODE_I2C;
  I2C_InitStructure.TypeAcknowledge = LL_I2C_ACK; // enable event generation for CheckEvent
  I2C_InitStructure.OwnAddress1 = 0x00;
  I2C_InitStructure.OwnAddrSize = LL_I2C_OWNADDRESS1_7BIT;

  I2C_InitStructure.AnalogFilter    = LL_I2C_ANALOGFILTER_ENABLE;
  I2C_InitStructure.DigitalFilter   = 0x00;

  //I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
  //I2C_InitStructure.I2C_ClockSpeed = (uint32_t)inf->bitrate; // 50 kHz I2C speed

  LL_I2C_Init(I2Cx, &I2C_InitStructure);

  //LL_I2C_EnableIT_RX(I2Cx);
  //LL_I2C_EnableIT_NACK(I2Cx);
  //LL_I2C_EnableIT_ERR(I2Cx);
  //LL_I2C_EnableIT_STOP(I2Cx);
  //LL_I2C_EnableIT_TX(I2Cx);
#endif
  LL_I2C_Disable(I2Cx);

  LL_I2C_SetTiming(I2Cx, 0x00F02B86);

  LL_I2C_Enable(I2Cx);
}

/** Write a number of btes to the I2C device. Addresses are 7 bit - that is, between 0 and 0x7F.
 *  sendStop is whether to send a stop bit or not */
void jshI2CWrite(IOEventFlags device, unsigned char address, int nBytes, const unsigned char *data, bool sendStop){

  //jsiConsolePrintf("\n>jshI2CWrite device=%d, address=%x, nBytes=%d, data=%x %x, sendStop=%d", device, address, nBytes, data[0], data[1], sendStop);
  I2C_TypeDef *I2C = getI2CFromDevice(device);

  LL_I2C_HandleTransfer(I2C, (unsigned char)(address << 1), LL_I2C_ADDRSLAVE_7BIT, nBytes, LL_I2C_MODE_AUTOEND, LL_I2C_GENERATE_START_WRITE);

  while(!LL_I2C_IsActiveFlag_STOP(I2C))
  {
    /* Transmit data (TXIS flag raised) */

    /* Check TXIS flag value in ISR register */
    if(LL_I2C_IsActiveFlag_TXIS(I2C))
    {
      /* Write data in Transmit Data register.
      TXIS flag is cleared by writing data in TXDR register */
      LL_I2C_TransmitData8(I2C, (*data++));

    }
  }

  LL_I2C_ClearFlag_STOP(I2C);

  return;
}

/** Read a number of bytes from the I2C device. */
void jshI2CRead(IOEventFlags device, unsigned char address, int nBytes, unsigned char *data, bool sendStop){
  int i = 0;
  I2C_TypeDef *I2C = getI2CFromDevice(device);

  LL_I2C_HandleTransfer(I2C, (unsigned char)(address << 1), LL_I2C_ADDRSLAVE_7BIT, nBytes, LL_I2C_MODE_AUTOEND, LL_I2C_GENERATE_START_READ);

  while(!LL_I2C_IsActiveFlag_STOP(I2C)) {
    /* Receive data (RXNE flag raised) */

    /* Check RXNE flag value in ISR register */
    if(LL_I2C_IsActiveFlag_RXNE(I2C))
    {
      /* Read character in Receive Data register.
      RXNE flag is cleared by reading data in RXDR register */
      data[i++] = LL_I2C_ReceiveData8(I2C);
    }
  }
  LL_I2C_ClearFlag_STOP(I2C);

  return;
}

/** Return start address and size of the flash page the given address resides in. Returns false if
  * the page is outside of the flash address range */
bool jshFlashGetPage(uint32_t addr, uint32_t *startAddr, uint32_t *pageSize){
  if (addr<FLASH_START ||
      addr>=FLASH_START+FLASH_TOTAL)
    return false;
  if (startAddr) *startAddr = addr & (uint32_t)~(FLASH_PAGE_SIZE-1);
  if (pageSize) *pageSize = FLASH_PAGE_SIZE;
  return true;
}

/** Return a JsVar array containing objects of the form `{addr, length}` for each contiguous block of free
 * memory available. These should be one complete pages, so that erasing the page containing any address in
 * this block won't erase anything useful! */
static void addFlashArea(JsVar *jsFreeFlash, uint32_t addr, uint32_t length) {
  JsVar *jsArea = jsvNewObject();
  if (!jsArea) return;
  jsvObjectSetChildAndUnLock(jsArea, "addr", jsvNewFromInteger((JsVarInt)addr));
  jsvObjectSetChildAndUnLock(jsArea, "length", jsvNewFromInteger((JsVarInt)length));
  jsvArrayPushAndUnLock(jsFreeFlash, jsArea);
}

JsVar *jshFlashGetFree(){
  JsVar *jsFreeFlash = jsvNewEmptyArray();
  if (!jsFreeFlash) return 0;

  // Try and find the page after the end of firmware
  extern int LINKER_ETEXT_VAR; // end of flash text (binary) section
  uint32_t firmwareEnd = FLASH_START | (uint32_t)&LINKER_ETEXT_VAR;
  uint32_t pAddr, pSize;
  jshFlashGetPage(firmwareEnd, &pAddr, &pSize);
  firmwareEnd = pAddr+pSize;
  if (firmwareEnd < FLASH_SAVED_CODE_START)
    addFlashArea(jsFreeFlash, firmwareEnd, FLASH_SAVED_CODE_START-firmwareEnd);

  // Otherwise add undocumented memory
  addFlashArea(jsFreeFlash, FLASH_SAVED_CODE_START, FLASH_SAVED_CODE_LENGTH);

  return jsFreeFlash;

}

/**
  * @brief  Gets the bank of a given address
  * @param  Addr: Address of the FLASH Memory
  * @retval The bank of a given address
  */
static uint32_t GetBank(uint32_t Addr){
  uint32_t bank = 0;
  if (READ_BIT(SYSCFG->MEMRMP, SYSCFG_MEMRMP_FB_MODE) == 0){
    /* No Bank swap */
    if (Addr < (FLASH_BASE + FLASH_BANK_SIZE)){
      bank = FLASH_BANK_1;
    } else{
      bank = FLASH_BANK_2;
    }
  } else{
    /* Bank swap */
    if (Addr < (FLASH_BASE + FLASH_BANK_SIZE)){
      bank = FLASH_BANK_2;
    } else{
      bank = FLASH_BANK_1;
    }
  }

  return bank;
}

/**
  * @brief  Gets the page of a given address
  * @param  Addr: Address of the FLASH Memory
  * @retval The page of a given address
  */
static uint32_t GetPage(uint32_t Addr){
  uint32_t page = 0;

  if (Addr < (FLASH_BASE + FLASH_BANK_SIZE)){
    /* Bank 1 */
    page = (Addr - FLASH_BASE) / FLASH_PAGE_SIZE;
  } else {
    /* Bank 2 */
    page = (Addr - (FLASH_BASE + FLASH_BANK_SIZE)) / FLASH_PAGE_SIZE;
  }

  return page;
}

/// Erase the flash page containing the address
void jshFlashErasePage(uint32_t addr){
  static FLASH_EraseInitTypeDef EraseInitStruct;
  uint32_t bank = GetBank(addr);
  uint32_t page = GetPage(addr);
  uint32_t PAGEError = 0;

  HAL_FLASH_Unlock();

  // Clear All pending flags
  //__HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | /*FLASH_FLAG_PGERR | FLASH_FLAG_WRPRTERR*/);

  EraseInitStruct.TypeErase   = FLASH_TYPEERASE_PAGES;
  EraseInitStruct.Banks       = bank;
  EraseInitStruct.Page        = page;
  EraseInitStruct.NbPages     = 1;

  if( HAL_FLASHEx_Erase(&EraseInitStruct, &PAGEError) != HAL_OK){
    Error_Callback();
  }

  HAL_FLASH_Lock();

